import { clsx, type ClassValue } from "clsx"
import { twMerge } from "tailwind-merge"

export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs))
}

export function getMetroStationColor(stationName: string): string {
  switch (true) {
    case [
      "Девяткино",
      "Гражданский проспект",
      "Академическая",
      "Политехническая",
      "Площадь Мужества",
      "Лесная",
      "Выборгская",
      "Площадь Ленина",
      "Чернышевская",
      "Площадь Восстания",
      "Владимирская",
      "Пушкинская",
      "Технологический институт",
      "Балтийская",
      "Нарвская",
      "Кировский завод",
      "Автово",
      "Ленинский проспект",
      "Проспект Ветеранов",
    ].includes(stationName):
      return "bg-red-600"

    case [
      "Парнас",
      "Проспект Просвещения",
      "Озерки",
      "Удельная",
      "Пионерская",
      "Чёрная речка",
      "Петроградская",
      "Горьковская",
      "Невский проспект",
      "Сенная площадь",
      "Технологический институт",
      "Фрунзенская",
      "Московские ворота",
      "Электросила",
      "Парк Победы",
      "Московская",
      "Звёздная",
      "Купчино",
    ].includes(stationName):
      return "bg-blue-600"

    case [
      "Беговая",
      "Зенит",
      "Приморская",
      "Василеостровская",
      "Гостиный двор",
      "Маяковская",
      "Площадь Александра Невского-1",
      "Елизаровская",
      "Ломоносовская",
      "Пролетарская",
      "Обухово",
      "Рыбацкое",
    ].includes(stationName):
      return "bg-green-600"

    case [
      "Спасская",
      "Достоевская",
      "Лиговский проспект",
      "Новочеркасская",
      "Ладожская",
      "Проспект Большевиков",
      "Улица Дыбенко",
    ].includes(stationName):
      return "bg-yellow-500"

    case [
      "Комендантский проспект",
      "Старая Деревня",
      "Крестовский остров",
      "Чкаловская",
      "Спортивная",
      "Адмиралтейская",
      "Садовая",
      "Звенигородская",
      "Обводный канал",
      "Волковская",
      "Бухарестская",
      "Международная",
      "Проспект Славы",
      "Дунайская",
      "Шушары",
    ].includes(stationName):
      return "bg-purple-600"

    default:
      return "bg-muted-foreground"
  }
}
